jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_usbss_host.h
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_usbss_host.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/05/23
* Description        : This file contains the headers of the ch32h417_usbss handlers.
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* SPDX-License-Identifier: Apache-2.0
*******************************************************************************/
#ifndef __CH32H417_USBSS_H
#define __CH32H417_USBSS_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ch32h417.h"

/******************************************************************************/
/*                                 USB 3.0                                    */
/******************************************************************************/

typedef enum {  Power_off = 0,
                Disconnected =1,
                DISABLED = 2,
                Training = 3,
                Enabled = 4,
                Resetting = 5,
                Error = 6,
                Loopback = 7,
                Compliance = 8
} PortState;

typedef struct  __attribute__((packed))USBSS_Port_Info {
    uint16_t port_change;
    uint16_t port_status;
    uint8_t set_u3_exit;
    uint8_t set_u3_enter;
    uint8_t set_u2_exit;
    uint8_t set_u2_enter;
    uint8_t set_u1_exit;
    uint8_t set_u1_enter;
    uint8_t set_warm_reset;
    uint8_t set_hot_reset;
    uint8_t port_rmt_wkup;
    uint8_t lp_mode;
    uint8_t DSPORT;
} USBSS_Port_Info;

// UEP_CR
#define EP_HALTED       (1<<7)
#define EP_CLR          (1<<6)
#define CHAIN_CLR       (1<<5)
#define ERDY_NUMP_MASK  (0x1f)
// UEP_ST
#define RES_ACK     (1<<4)


//#define USBSSH0_BASE      ((uint32_t)0x40038000)
#define USBSSH1_BASE      ((uint32_t)0x40038200)
#define USBSSH2_BASE      ((uint32_t)0x40038400)
#define USBSSH3_BASE      ((uint32_t)0x40038600)
#define USBSSH4_BASE      ((uint32_t)0x40038800)

#define USBSS_PHY_CFG_CR              (*((__IO uint32_t *)0x400341f8))          //这个地址才对
#define USBSS_PHY_CFG_DAT             (*((__IO uint32_t *)0x400341fc))      

#define USBSSH1_PHY_CFG_CR            (*((__IO uint32_t *)0x400383f8))
#define USBSSH1_PHY_CFG_DAT           (*((__IO uint32_t *)0x400383fc))

#define USBSSH2_PHY_CFG_CR            (*((__IO uint32_t *)0x400385f8))
#define USBSSH2_PHY_CFG_DAT           (*((__IO uint32_t *)0x400385fc))

#define USBSSH3_PHY_CFG_CR            (*((__IO uint32_t *)0x400387f8))
#define USBSSH3_PHY_CFG_DAT           (*((__IO uint32_t *)0x400387fc))

#define USBSSH4_PHY_CFG_CR            (*((__IO uint32_t *)0x400389f8))
#define USBSSH4_PHY_CFG_DAT           (*((__IO uint32_t *)0x400389fc))

//U3_ROOTx =((USBSSH_TypeDef *)(USBSS_BASE+i*0x100));

#define USBSSH1             ((USBSSH_TypeDef *) USBSSH1_BASE)
#define USBSSH2             ((USBSSH_TypeDef *) USBSSH2_BASE)
#define USBSSH3             ((USBSSH_TypeDef *) USBSSH3_BASE)
#define USBSSH4             ((USBSSH_TypeDef *) USBSSH4_BASE)

#define USBSS_DMA           ((uint32_t)0x20002000)

#define USBSSH1_TX_DMA      ((uint32_t)0x20002800)
#define USBSSH1_RX_DMA      ((uint32_t)0x20003000)
#define USBSSH2_TX_DMA      ((uint32_t)0x20003800)
#define USBSSH2_RX_DMA      ((uint32_t)0x20004000)
#define USBSSH3_TX_DMA      ((uint32_t)0x20004800)
#define USBSSH3_RX_DMA      ((uint32_t)0x20005000)
#define USBSSH4_TX_DMA      ((uint32_t)0x20005800)
#define USBSSH4_RX_DMA      ((uint32_t)0x20006000)

void USBSS_Endp_Init(void);
void USBSS_Endp_Deinit(void);
void USBSS_Endp_Disable(void);
void USBSSH_Init(void);
void USBSS_LINK_Handle( USBSSH_TypeDef *USBSSHx,uint8_t port_num );
//void usbssh_lmp_init(USBSSH_TypeDef *USBSSHx);
void send_setup_packet( USBSSH_TypeDef *USBSSHx );
void send_status_packet(USBSSH_TypeDef *USBSSHx);
void get_data( USBSSH_TypeDef *USBSSHx, uint32_t seq_num, uint8_t packet_num, uint32_t endp_num );
void send_data( USBSSH_TypeDef *USBSSHx, uint32_t seq_num, uint8_t packet_num, uint32_t endp_num, uint32_t tx_len );
void send_data_iso( USBSSH_TypeDef *USBSSHx, uint32_t seq_num, uint8_t packet_num, uint32_t endp_num, uint32_t tx_len );
void get_data_iso( USBSSH_TypeDef *USBSSHx, uint32_t seq_num, uint8_t packet_num, uint32_t endp_num );

void get_data_t( USBSSH_TypeDef *USBSSHx, uint32_t seq_num, uint8_t packet_num, uint32_t endp_num );

//void send_erdy( uint8_t endp, uint8_t nump, uint8_t dir );
void set_device_address( uint32_t address,USBSSH_TypeDef *USBSSx );
void switch_pwr_mode( USBSSH_TypeDef *USBSSHx,uint8_t pwr_mode );
void host_enum( uint32_t dev_addr, USBSSH_TypeDef *USBSSHx , uint32_t TX_DMAaddr);

void enter_loopback (void);
//void SetPortPwr( uint8_t port_num );

uint32_t USBSS_PHY_Cfg( uint8_t port_num, uint8_t addr, uint16_t data );
uint32_t USBSS_ReadPHYData(uint8_t port_num,uint8_t addr);
void USBSS_CFG_MOD(void);
void USBSS_PLL_Init( FunctionalState sta );


// LINK_AUTO MOD
#define U0_AUTO         (1<<0)
#define U1_AUTO         (1<<1)
#define U2_AUTO         (1<<2)
#define U3_AUTO         (1<<3)
#define DISABLED_AUTO   (1<<4)
#define RXDET_AUTO      (1<<5)
#define INACTIVE_AUTO   (1<<6)
//#define POLLING_AUTO    (1<<7)
#define TX_EQ_AUTO      (1<<8)
#define POLLING_AUTO    (1<<10)
#define U1_TOUT_AUTO    (1<<14)
#define U2_TOUT_AUTO    (1<<15)

/*---------------------------------------------*/
/* LINK_CFG */
#define U3_LINK_RESET               0x80000000
#define LINK_FORCE_RXTERM           0x00800000
#define LINK_FORCE_POLLING          0x00400000
#define LINK_TOUT_MODE              0x00200000
#define LINK_U2_ALLOW               0x00020000
#define LINK_U1_ALLOW               0x00010000
#define LINK_LTSSM_MODE             0x00008000
#define LINK_LOOPBACK_ACT           0x00004000
#define LINK_LOOPBACK_EN            0x00002000
#define LINK_U2_RXDET               0x00001000
#define LINK_CP78_SEL_MASK          0x00000C00
 #define LINK_CP78_SEL_190BITS      0x00000000
 #define LINK_CP78_SEL_120BITS      0x00000400
 #define LINK_CP78_SEL_50BITS       0x00000800
 #define LINK_CP78_SEL_250BITS      0x00000C00
#define LINK_TX_DEEMPH_MASK         0x00000300
 #define LINK_TX_DEEMPH_6DB         0x00000000
 #define LINK_TX_DEEMPH_3_5DB       0x00000100
#define LINK_TX_SWING               0x00000080
#define LINK_RX_EQ_EN               0x00000040
#define LINK_LFPS_RX_PD             0x00000020
#define LINK_COMPLIANCE_EN          0x00000010
#define LINK_PHY_RESET              0x00000008
#define LINK_SS_PLR_SWAP            0x00000004
#define LINK_RX_TERM_EN             0x00000002
#define LINK_DOWN_MODE              0x00000001

