jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_usbss_host.h
/* R32_HOST_STATUS */
#define USBSS_UH_ITP_PRESAGE        0x000C0000
#define USBSS_UH_RX_ISO_PKT_ERR     0x00020000
#define USBSS_UH_RX_EOB_LPF         0x00010000
#define USBSS_UH_RX_ERDY_DIR        0x00008000
#define USBSS_UH_RX_ERDY_NUMP       0x00001F00
#define USBSS_UH_RX_ERDY_EP         0x000000F0

#define TOUT_MODE       (1<<21)

#define HUB_DEPTH_MASK      (7<<24)
#define HUB_DEPTH_INVLD     (7<<24)

#define PM_MASK         ((uint32_t)0x00000003)
#define POWER_MODE_0    ((uint32_t)0x00000004)
#define POWER_MODE_1    ((uint32_t)0x00000005)
#define POWER_MODE_2    ((uint32_t)0x00000006)
#define POWER_MODE_3    ((uint32_t)0x00000007)

// #define GO_DISABLED     (1<<4)
// #define GO_INACTIVE     (1<<5)
// #define GO_RECOVERY     (1<<6)
// #define GO_RX_DET       (1<<7)

//#define POLLING_EN          ((uint32_t)1<<12)

// link int en

// link int flag

// USB CONTROL

#define USB_INT_EP_MASK     (0x7<<8)
//#define USB_INT_RES_MASK    (0x3<<14)
//#define USB_RES_ACK         (0x0<<14)
//#define USB_RES_ERDY        (0x1<<14)
//#define USB_RES_NRDY        (0x2<<14)
//#define USB_RES_STALL       (0x3<<14)

#define USB_TX_RES_MASK     (0x3<<22)
#define TX_RES_ACK          (0x0<<22)
#define TX_RES_FAILED       (0x1<<22)
#define TX_RES_NRDY         (0x2<<22)
#define TX_RES_STALL        (0x3<<22)

#define USB_RX_RES_MASK     (0x3<<30)
#define RX_RES_ACK          (0x0<<30)
#define RX_RES_FAILED       (0x1<<30)
#define RX_RES_NRDY         (0x2<<30)
#define RX_RES_STALL        (0x3<<30)

#define USB_SEQ_MASK        (0x1f<<21)

// #define USB_INT_ST_MASK      0xf<<16
// #define USB_SEQ_MATCH        0x1<<16

#define USB_TX_LPF          (0x1<<28)

#define USB_STATUS_IS       (0x1<<29)
#define USB_SETUP_IS        (0x1<<30)
#define USB_TX_DIR          (0x1<<12)


#define USB_ERDY_ENDP_MASK  (0xf<<4)
#define USB_ERDY_NUMP_MASK  (0x1f<<8)
// #define USB_ITP_PREAGE       (0x1<<31)


#define EP0_EN            (1<<0)
#define EP1_EN            (1<<1)
#define EP2_EN            (1<<2)
#define EP3_EN            (1<<3)
#define EP4_EN            (1<<4)
//#define EP5_EN            (1<<5)
//#define EP6_EN            (1<<6)
//#define EP7_EN            (1<<7)

#define EP1_ISO           (1<<17)
#define EP2_ISO           (1<<18)
#define EP3_ISO           (1<<19)
#define EP4_ISO           (1<<20)
#define EP5_ISO           (1<<21)
#define EP6_ISO           (1<<22)
#define EP7_ISO           (1<<23)

#define TX_ERDY_ACT         (1<<0)
#define TX_ERDY_DIR         (1<<1)
#define TX_ERDY_ENDP_0      (0<<2)
#define TX_ERDY_ENDP_1      (1<<2)
#define TX_ERDY_ENDP_2      (2<<2)
#define TX_ERDY_ENDP_3      (3<<2)
#define TX_ERDY_ENDP_4      (4<<2)
#define TX_ERDY_ENDP_5      (5<<2)
#define TX_ERDY_ENDP_6      (6<<2)
#define TX_ERDY_ENDP_7      (7<<2)

#define TX_ERDY_NUMP_0      (0<<6)
#define TX_ERDY_NUMP_1      (1<<6)
#define TX_ERDY_NUMP_2      (2<<6)
#define TX_ERDY_NUMP_3      (3<<6)
#define TX_ERDY_NUMP_4      (4<<6)
#define TX_ERDY_NUMP_5      (5<<6)
#define TX_ERDY_NUMP_6      (6<<6)
#define TX_ERDY_NUMP_7      (7<<6)
#define TX_ERDY_NUMP_8      (8<<6)

// host
#define UH_T_EN             (1<<1)
#define UH_R_EN             (1<<1)
//#define UH_R_ISO            (1<<17)
//#define UH_T_ISO            (1<<17)

#define UH_ISO_MODE         (1<<30)
#define UH_TX_SETUP         (0x1<<29)
#define UH_TX_STATUS        (0x1<<28)
#define UH_TX_LPF           (0x1<<23)
#define UH_RTX_VALID        (0x1<<21)

#define UH_RX_EOB           (0x1<<16)
#define UH_ISO_RX_ERR       (0x1<<17)

#define UH_INT_FLAG         (1<<31)


#define USB_ACT_FLAG        0x01
#define USB_SETUP_FLAG      0x02
#define USB_STATUS_FLAG     0x04
#define USB_RX_PING_FLAG    0x08
#define USB_ITP_FLAG        0x10
#define USB_TXOV_FLAG       0x40
#define USB_RXOV_FLAG       0x80
#define USB_ERDY_FLAG       0x02
#define USB_NOTIF_FLAG      0x04

// PING-TP
#define TP_HP           4

#define PING_TP         7
#define PING_DIR        (1<<7)
#define PING_ENDP       (2<<8)

#define DEV_NOTIF_TP    6
#define FUNC_WAKE       (1<<4)

// LMP
#define LMP_HP          0
// LMP subtype
#define LMP_SUBTYPE_MASK        (0xf<<5)
#define LMP_SET_LINK_FUNC       (0x1<<5)
#define LMP_U2_INACT_TOUT       (0x2<<5)
#define LMP_VENDOR_TEST         (0x3<<5)
#define LMP_PORT_CAP            (0x4<<5)
#define LMP_PORT_CFG            (0x5<<5)
#define LMP_PORT_CFG_RES        (0x6<<5)

#define LMP_LINK_SPEED          (1<<9)

#define NUM_HP_BUF      (4<<0)
#define DOWN_STREAM     (1<<16)
#define UP_STREAM       (2<<16)
#define TIE_BRK         (1<<20)

#define DEF_USBSSD_UEP0_SIZE           512
extern __attribute__ ((aligned(4))) uint8_t USBSS_EP0_Tx_Buf[ DEF_USBSSD_UEP0_SIZE ];
extern __attribute__ ((aligned(4))) uint8_t USBSS_EP0_Rx_Buf[ DEF_USBSSD_UEP0_SIZE ];

#ifdef __cplusplus
}
#endif


#endif /* __ch32h417_USBSS_H */

